In [1]:
# Dependencies
# ----------------------------------
# Imports the method used for connecting to DBs
from sqlalchemy import create_engine


# Imports the methods needed to abstract classes into tables
from sqlalchemy.ext.declarative import declarative_base

# Allow us to declare column types
from sqlalchemy import Column, Integer, String, Float, Date

#Import Pandas
import pandas as pd

In [2]:
# Read csv files and create dataframes

path_to_bonds_value_csv="Bonds (closing price).csv"
bondsprice_df=pd.read_csv(path_to_bonds_value_csv, index_col=0)

path_to_bonds_returns_csv="Bonds (daily returns).csv"
bondsdaily_df=pd.read_csv(path_to_bonds_returns_csv, index_col=0)

path_to_gold_value_csv="Gold (closing price).csv"
goldprice_df=pd.read_csv(path_to_gold_value_csv, index_col=0)

path_to_gold_returns_csv="Gold (daily returns).csv"
golddaily_df=pd.read_csv(path_to_gold_returns_csv, index_col=0)

path_to_nasdaq_value_csv="Nasdaq (closing price).csv"
nasdaqprice_df=pd.read_csv(path_to_nasdaq_value_csv, index_col=0)

path_to_nasdaq_returns_csv="Nasdaq (daily returns).csv"
nasdaqdaily_df=pd.read_csv(path_to_nasdaq_returns_csv, index_col=0)

path_to_nikkei_value_csv="Nikkei (closing price).csv"
nikkeiprice_df=pd.read_csv(path_to_nikkei_value_csv, index_col=0)

path_to_nikkei_returns_csv="Nikkei (daily returns).csv"
nikkeidaily_df=pd.read_csv(path_to_nikkei_returns_csv, index_col=0)

path_to_merge_value_csv="Merge (All closing prices).csv"
mergeprice_df=pd.read_csv(path_to_merge_value_csv, index_col=0)

path_to_merge_returns_csv="Merge_all (daily returns).csv"
mergedaily_df=pd.read_csv(path_to_merge_returns_csv, index_col=0)

In [3]:
# Create Database Connection
# ----------------------------------
# Creates a connection to our DB
# Do not duplicate this cell. There is no need 
engine = create_engine("sqlite:///market.sqlite")
conn = engine.connect()

In [4]:
# Convert dataframes into .sqlite files

bondsprice_df.to_sql("BondsClosing",engine,if_exists="replace")

bondsdaily_df.to_sql("BondsDaily",engine,if_exists="replace")

goldprice_df.to_sql("GoldClosing",engine,if_exists="replace")

golddaily_df.to_sql("GoldDaily",engine,if_exists="replace")

nasdaqprice_df.to_sql("NasdaqClosing",engine,if_exists="replace")

nasdaqdaily_df.to_sql("NasdaqDaily",engine,if_exists="replace")

nikkeiprice_df.to_sql("NikkeiClosing",engine,if_exists="replace")

nikkeidaily_df.to_sql("NikkeiDaily",engine,if_exists="replace")

mergeprice_df.to_sql("MergeAllClosing",engine,if_exists="replace")

mergedaily_df.to_sql("MergeAllDaily",engine,if_exists="replace")

In [5]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("BondsClosing",conn)

             Date  Bonds_10year
0      1979-12-27        10.460
1      1979-12-28        10.410
2      1979-12-31        10.330
3      1980-01-02        10.500
4      1980-01-03        10.600
...           ...           ...
10269  2021-02-08         1.160
10270  2021-02-09         1.157
10271  2021-02-10         1.133
10272  2021-02-11         1.158
10273  2021-02-12         1.200

[10274 rows x 2 columns]

In [6]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("BondsDaily",conn)

             Date  Bonds_10year
0      1979-12-28     -0.478011
1      1979-12-31     -0.768492
2      1980-01-02      1.645692
3      1980-01-03      0.952381
4      1980-01-04      0.566038
...           ...           ...
10268  2021-02-08     -0.854701
10269  2021-02-09     -0.258621
10270  2021-02-10     -2.074330
10271  2021-02-11      2.206531
10272  2021-02-12      3.626943

[10273 rows x 2 columns]

In [7]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("GoldClosing",conn)

             Date  XAU_USD
0      1979-12-27   515.50
1      1979-12-28   512.00
2      1980-01-01   512.00
3      1980-01-02   559.75
4      1980-01-03   634.25
...           ...      ...
10659  2021-02-10  1842.22
10660  2021-02-11  1825.36
10661  2021-02-12  1823.46
10662  2021-02-14  1821.11
10663  2021-02-15  1818.54

[10664 rows x 2 columns]

In [8]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("GoldDaily",conn)

             Date    XAU_USD
0      1979-12-28  -0.678952
1      1980-01-01   0.000000
2      1980-01-02   9.326172
3      1980-01-03  13.309513
4      1980-01-04   0.000000
...           ...        ...
10658  2021-02-10   0.280884
10659  2021-02-11  -0.915200
10660  2021-02-12  -0.104089
10661  2021-02-14  -0.128876
10662  2021-02-15  -0.141123

[10663 rows x 2 columns]

In [9]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("NasdaqClosing",conn)

             Date    NASDAQ_100
0      1979-12-27    150.229996
1      1979-12-28    150.830002
2      1979-12-31    151.139999
3      1980-01-02    148.169998
4      1980-01-03    145.970001
...           ...           ...
10367  2021-02-08  13987.639648
10368  2021-02-09  14007.700195
10369  2021-02-10  13972.530273
10370  2021-02-11  14025.769531
10371  2021-02-12  14095.469727

[10372 rows x 2 columns]

In [10]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("NasdaqDaily",conn)

             Date  NASDAQ_100
0      1979-12-28    0.399392
1      1979-12-31    0.205527
2      1980-01-02   -1.965066
3      1980-01-03   -1.484779
4      1980-01-04    1.404400
...           ...         ...
10366  2021-02-08    0.947871
10367  2021-02-09    0.143416
10368  2021-02-10   -0.251076
10369  2021-02-11    0.381028
10370  2021-02-12    0.496944

[10371 rows x 2 columns]

In [11]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("NikkeiClosing",conn)

             Date    NIKKEI_225
0      1979-12-27   6528.830078
1      1979-12-28   6569.470215
2      1980-01-04   6560.160156
3      1980-01-07   6552.649902
4      1980-01-08   6563.279785
...           ...           ...
10114  2021-02-08  29388.500000
10115  2021-02-09  29505.929688
10116  2021-02-10  29562.929688
10117  2021-02-12  29520.070313
10118  2021-02-15  30084.150391

[10119 rows x 2 columns]

In [12]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("NikkeiDaily",conn)

             Date  NIKKEI_225
0      1979-12-28    0.622472
1      1980-01-04   -0.141717
2      1980-01-07   -0.114483
3      1980-01-08    0.162223
4      1980-01-09    0.435000
...           ...         ...
10113  2021-02-08    2.117191
10114  2021-02-09    0.399577
10115  2021-02-10    0.193182
10116  2021-02-12   -0.144977
10117  2021-02-15    1.910836

[10118 rows x 2 columns]

In [13]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("MergeAllClosing",conn)

            Date  Bonds_10year    NASDAQ_100    NIKKEI_225  XAU_USD
0     1979-12-27        10.460    150.229996   6528.830078   515.50
1     1979-12-28        10.410    150.830002   6569.470215   512.00
2     1980-01-04        10.660    148.020004   6560.160156   634.25
3     1980-01-07        10.630    148.619995   6552.649902   634.00
4     1980-01-08        10.570    150.679993   6563.279785   610.00
...          ...           ...           ...           ...      ...
9713  2021-02-05         1.170  13856.299805  28779.189453  1811.62
9714  2021-02-08         1.160  13987.639648  29388.500000  1830.16
9715  2021-02-09         1.157  14007.700195  29505.929688  1837.06
9716  2021-02-10         1.133  13972.530273  29562.929688  1842.22
9717  2021-02-12         1.200  14095.469727  29520.070313  1823.46

[9718 rows x 5 columns]

In [14]:
# this is optional 
#To be done in different cells for each to view what is in the .sqlite file
pd.read_sql("MergeAllDaily",conn)

            Date  Bonds_10year  NASDAQ_100  NIKKEI_225    XAU_USD
0     1979-12-28     -0.478011    0.399392    0.622472  -0.678952
1     1980-01-04      2.401537   -1.863023   -0.141717  23.876953
2     1980-01-07     -0.281426    0.405345   -0.114483  -0.039417
3     1980-01-08     -0.564440    1.386084    0.162223  -3.785489
4     1980-01-09      0.094607    0.610574    0.435000  -0.459016
...          ...           ...         ...         ...        ...
9712  2021-02-05      2.721686    0.570192    1.542732   1.080200
9713  2021-02-08     -0.854701    0.947871    2.117191   1.023393
9714  2021-02-09     -0.258621    0.143416    0.399577   0.377016
9715  2021-02-10     -2.074330   -0.251076    0.193182   0.280884
9716  2021-02-12      5.913504    0.879865   -0.144977  -1.018337

[9717 rows x 5 columns]